app/controllers/books_controller.rb

  def index
    @book=Book.new
    @books=Book.all
---
SELECT "books".* FROM "books"

  def show
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 66], ["LIMIT", 1]]

  def create
    @book=Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:success] = "You have created book successfully."
      redirect_to book_path(@book.id)
    else
      @user=current_user
      @books=Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "d"], ["body", "ddd"], ["user_id", 11], ["created_at", "2021-10-24 05:25:19.362958"], ["updated_at", "2021-10-24 05:25:19.362958"]]
SELECT "books".* FROM "books"

  def edit
    @book=Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 67], ["LIMIT", 1]]

  def update
    @book=Book.find(params[:id])
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 67], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "dddaaaa"], ["updated_at", "2021-10-24 08:01:23.078125"], ["id", 67]]

  def destroy
    book=Book.find(params[:id])
    book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]