app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @user=current_user
    @book=Book.new
    @users=User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user=User.find(params[:id])
    @book=Book.new
    @books=Book.where(user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "a"], ["profile_image_id", "b23f0e9bc141f05f7ba8714f9367ec593ade2bc2e5317d15b040716d4ef8"], ["updated_at", "2021-10-22 08:25:22.316277"], ["id", 1]]
---
  def update
    user=User.find(params[:id])
    if user.update(user_params)